In [1]:
# load libraries
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [2]:
# load csv
df = pd.read_csv('temp.csv')

In [3]:
df.dtypes

Number      int64
A1         object
A2        float64
A3         object
B1        float64
dtype: object

In [4]:
df.sample(7)

   Number             A1       A2             A3      B1
2       3              0  0.10000  Not available   0.700
0       1            0.3  0.70000            0.9   0.990
6       7          0.003  0.00006         0.0011   0.008
4       5           0.22  0.23000           0.55   4.000
3       4              1  2.00000              3  33.000
5       6  Not available  2.00000              2   9.000
1       2  Not available  0.00000            0.1   0.700

In [5]:
# replace all occurrences of 'Not available' with nan

df = df.replace('Not available', np.nan)

In [6]:
df

   Number     A1       A2      A3      B1
0       1    0.3  0.70000     0.9   0.990
1       2    NaN  0.00000     0.1   0.700
2       3      0  0.10000     NaN   0.700
3       4      1  2.00000       3  33.000
4       5   0.22  0.23000    0.55   4.000
5       6    NaN  2.00000       2   9.000
6       7  0.003  0.00006  0.0011   0.008

In [7]:
# listing columns in dataframe
for col in df:
    print(col)

Number
A1
A2
A3
B1

In [8]:
# counting nan values
for col in df:
    print(df[col].value_counts(dropna=False))

7    1
6    1
5    1
4    1
3    1
2    1
1    1
Name: Number, dtype: int64
NaN      2
0.003    1
1        1
0.3      1
0        1
0.22     1
Name: A1, dtype: int64
2.00000    2
0.00006    1
0.10000    1
0.70000    1
0.23000    1
0.00000    1
Name: A2, dtype: int64
3         1
0.1       1
0.55      1
0.9       1
0.0011    1
2         1
NaN       1
Name: A3, dtype: int64
0.700     2
0.990     1
0.008     1
9.000     1
4.000     1
33.000    1
Name: B1, dtype: int64

In [9]:
df.dtypes

Number      int64
A1         object
A2        float64
A3         object
B1        float64
dtype: object

In [10]:
# convert to float64

for col in df:
    df[col] = df[col].astype(float)

In [11]:
df.dtypes

Number    float64
A1        float64
A2        float64
A3        float64
B1        float64
dtype: object